ZigZagT/FreeCopter/src/wrapper/device/m0518sd2ae/main.c
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "M0518.h"
#include "define.h"
#include "i2c_rw.h"

/*---------------------------------------------------------------------------------------------------------*/
/* Macro, type and constant definitions                                                                    */
/*---------------------------------------------------------------------------------------------------------*/

// #define DEBUG                       1

#define PLLCON_SETTING              CLK_PLLCON_50MHz_HXT
#define PLL_CLOCK                   50000000

#define PWM_PERIOD_US               11000
#define PWM_LOW_BOUND_US            1200
#define PWM_HI_BLUND_US             1800
#define PWM_PERIOD_LIMIT_US         11000
#define PWM_LOW_BOUND_LIMIT_US      900
#define PWM_HI_BOUND_LIMIT_US       2200
#define PWM_GLOBAL_PRESCALE         5

#define Enable_PWM0_INT()       (PWM0->CAPIEN |= (0x15 << 8))
#define Disable_PWM0_INT()      (PWM0->CAPIEN &= (~(0x15 << 8)))
#define Enable_PWM1_INT()       (PWM1->CAPIEN |= (0x15 << 8))
#define Disable_PWM1_INT()      (PWM1->CAPIEN &= (~(0x15 << 8)))

#define PWM_GET_CMR(pwm, u32ChannelNum) ((pwm)->CMPBUF[(u32ChannelNum)])
#define PWM_GET_CNR(pwm, u32ChannelNum)  ((pwm)->PBUF[(((u32ChannelNum) >> 1) << 1)])
#define BPWM_GET_CMR(bpwm, u32ChannelNum) ((bpwm)->CMPBUF[(u32ChannelNum)])
#define BPWM_GET_CNR(bpwm) ((bpwm)->PBUF)

double PWM_Cycle_Per_US;
int PWM_NS_Per_Cycle;

int PWM_Cycle_Per_Period;
int PWM_Cycle_Low_Bound;
int PWM_Cycle_Hi_Bound;
int PWM_Cycle_Per_Period_Limit;
int PWM_Cycle_Low_Bound_Limit;
int PWM_Cycle_Hi_Bound_Limit;

I2C_SEND_T I2C_Send_Control;
I2C_RECV_T I2C_Recv_Control;

size_t buf_cap = 200;
size_t buf_len = 200;
char buf[200];

void PWM0_IRQHandler(void);
void PWM1_IRQHandler(void);
void I2C0_IRQHandler(void);
void SYS_Init(void);
void PWM_INIT( void );
void I2C_RESET(void);
void I2C_INIT(void);
void I2C_Slave_Go(I2C_T* port, uint32_t status);

#if defined(DEBUG)
unsigned PWM0_COUNTER = 0;
unsigned PWM0_COUNTER_LIMIT;
void draw_graph(int* arr, int n) {
    int max = 0;
    int temp;
    static char buf[100] = "";
    
    // printf("\tarray dump: \n\tn=%d\n", n);
    for (temp = 0; temp < n; ++temp) {
    //   printf("arr[%d] = \t%d\n", temp, arr[temp]);
        if (arr[temp] > max) {
            max = arr[temp];
        }
        buf[2 * temp] = '\t';
    }
    // putchar('\n');
    buf[2 * temp] = '\0';
    buf[2 * temp + 1] = '\0';
    
    while (max > 0) {
        for (temp = 0; temp < n; ++temp) {
            if (arr[temp] >= max) {
                buf[2 * temp + 1] = '*';
            } else {
                buf[2 * temp + 1] = ' ';
            }
        }
        printf("%s\t| max= %d\n", buf, max);
        max -= 1;
    }
    for (temp = 0; temp < n; ++temp) {
        printf("\t%d", arr[temp]);
    }
    putchar('\n');
    for (temp = 0; temp < n * 9; ++temp) {
        putchar('-');
    }
    putchar('\n');
    putchar('\n');
}

#endif
 
void PWM0_IRQHandler(void) {
    Disable_PWM0_INT();
    PWM0->CAPIF = 0x3f3f;
    
    unsigned int index;
    unsigned int falling_data, rising_data;
    unsigned int high_period, low_period, total_period;
        
    for (   index = 0; 
            index < 6;
            index += 2   ) {
        
        falling_data = PWM_GET_CAPTURE_FALLING_DATA(PWM0, index);
        rising_data = PWM_GET_CAPTURE_RISING_DATA(PWM0, index);
        high_period = rising_data - falling_data;
        low_period = 0x10000 - rising_data;
        total_period = high_period + low_period;
        if (high_period < PWM_Cycle_Low_Bound && high_period >= PWM_Cycle_Low_Bound_Limit) {
            PWM_Cycle_Low_Bound = high_period;
        }
        if (high_period > PWM_Cycle_Hi_Bound && high_period <= PWM_Cycle_Hi_Bound_Limit) {
            PWM_Cycle_Hi_Bound = high_period;
        }
        if (total_period > PWM_Cycle_Per_Period && total_period <= PWM_Cycle_Per_Period_Limit) {
            PWM_Cycle_Per_Period = total_period;
        }
        
        if(high_period >= PWM_Cycle_Low_Bound && high_period <= PWM_Cycle_Hi_Bound) {
            
            BPWM_SET_CNR(BPWM0, index, PWM_Cycle_Per_Period);
            BPWM_SET_CMR(BPWM0, index, high_period);
        }
    }
    Enable_PWM0_INT();
}
// void PWM0_IRQHandler(void) {
//     Disable_PWM0_INT();
//     //int capture_int_flag = PWM0->CAPIF & 0x3f3f;
//     #if defined(DEBUG)
//     if (PWM0_COUNTER > PWM0_COUNTER_LIMIT) {
//         printf("PWM0 IRQ on %x\n", capture_int_flag);
//     }
//     #endif
//     PWM0->CAPIF = 0x3f3f;
//     //capture_int_flag >>= 8;
    
//     unsigned int index, bitflag;
//     unsigned int falling_data, rising_data;
//     unsigned int high_period, low_period, total_period;
    
//     #if defined(DEBUG)
//     static int level[6] = {0, 0, 0, 0, 0, 0};
//         PWM0_COUNTER_LIMIT = 4 * (1000000 / PWM_PERIOD_US);
//         //printf("INT!\n");
        
//         // if (PWM0_COUNTER > PWM0_COUNTER_LIMIT) {
//         //     printf("BPWM STATUS:\n");
//         //     for (int index = 0; index < 6; ++index) {
//         //         printf(
//         //             "\tCH %d: \t%dus\tof\t%dus\n",
//         //             index,
//         //             BPWM_GET_CMR(BPWM0, index) / PWM_Cycle_Per_US,
//         //             BPWM_GET_CNR(BPWM0) / PWM_Cycle_Per_US
//         //         );
//         //     }
//         //     printf("\n");
//         // }
//     #endif
    
//     for (   index = 0, bitflag = 1; 
//             index < 6; // && capture_int_flag & bitflag;
//             index += 2, bitflag <<= 2   ) {
//     // index = 0;
//     // bitflag = 1;
//     // while(index < 6 && capture_int_flag & bitflag) {
        
//         falling_data = PWM_GET_CAPTURE_FALLING_DATA(PWM0, index);
//         rising_data = PWM_GET_CAPTURE_RISING_DATA(PWM0, index);
//         high_period = rising_data - falling_data;
//         low_period = 0x10000 - rising_data;
//         total_period = high_period + low_period;
//         if (high_period < PWM_Cycle_Low_Bound && high_period >= PWM_Cycle_Low_Bound_Limit) {
//             PWM_Cycle_Low_Bound = high_period;
//         }
//         if (high_period > PWM_Cycle_Hi_Bound && high_period <= PWM_Cycle_Hi_Bound_Limit) {
//             PWM_Cycle_Hi_Bound = high_period;
//         }
//         if (total_period > PWM_Cycle_Per_Period && total_period <= PWM_Cycle_Per_Period_Limit) {
//             PWM_Cycle_Per_Period = total_period;
//         }
        
