ZigZagT/FreeCopter/src/wrapper/device/m0518sd2ae/main.c
    // (PWM0->CAPIEN |= 0x3f << 6);
    // (PWM1->CAPIEN |= 0x3f << 6);
    //(PWM0->CAPIEN &= ~(0x3f << 6))
    //(PWM1->CAPIEN &= ~(0x3f << 6))
    
    
}

void I2C_RESET(void) {
    // Reset I2C
    SYS_ResetModule(I2C0_RST);
    
    /* Open I2C module and set bus clock */
    I2C_Open(I2C0, 100000);
    
    /* Set I2C 4 Slave Addresses */
    I2C_SetSlaveAddr(I2C0, 0, 0x15, 0);   /* Slave Address : 0x15 */
    I2C_SetSlaveAddr(I2C0, 1, 0x35, 0);   /* Slave Address : 0x35 */
    I2C_SetSlaveAddr(I2C0, 2, 0x55, 0);   /* Slave Address : 0x55 */
    I2C_SetSlaveAddr(I2C0, 3, 0x75, 0);   /* Slave Address : 0x75 */

    /* Set I2C 4 Slave Addresses Mask */
    /*
    I2C_SetSlaveAddrMask(I2C0, 0, 0x01);
    I2C_SetSlaveAddrMask(I2C0, 1, 0x04);
    I2C_SetSlaveAddrMask(I2C0, 2, 0x01);
    I2C_SetSlaveAddrMask(I2C0, 3, 0x04);
    */


    //I2C_SEND_RESET(&I2C_Send_Control);
    I2C_RECV_RESET(&I2C_Recv_Control);
    
    I2C_SET_FLAG(&I2C_Send_Control, I2C_FLAG_SEND_REPEAT);

    /* Enable I2C interrupt */
    I2C_EnableInt(I2C0);
    NVIC_EnableIRQ(I2C0_IRQn);
        
    I2C_SET_CONTROL_REG(I2C0, I2C_I2CON_SI_AA);
    
}

void I2C_INIT(void)
{
    I2C_SEND_INIT(&I2C_Send_Control, 200);
    I2C_RECV_INIT(&I2C_Recv_Control, 200);
    
    I2C_RESET();
}

void I2C_Slave_Go(I2C_T* port, uint32_t status) {
    #if defined(DEBUG)
    //printf("I2C_Slave_Go!\n");
    #endif
    
    if(status != 0x60 && status != 0x80 && status != 0xa0) {
        printf("I2C status 0x%X\n", status);
    }
    switch (status) {              
        case I2C_STATUS_SLAVE_RESTART_STOP:
        I2C_Flush_Recv_Data(&I2C_Recv_Control);
        I2C_RESET();
        break;
        
        case I2C_STATUS_SLAVE_RECV_DATA_NACK:
        I2C_Flush_Recv_Data(&I2C_Recv_Control);
        I2C_SET_CONTROL_REG(port, I2C_I2CON_SI_AA);
        break;
            
        case I2C_STATUS_SLAVE_SEND_DATA_NACK:
        I2C_SET_CONTROL_REG(port, I2C_I2CON_SI_AA);
        if (status == I2C_STATUS_SLAVE_SEND_DATA_NACK) {
            printf("I2C_STATUS_SLAVE_SEND_DATA_NACK\n");
        }
        break;
        
        case I2C_STATUS_SLAVE_SEND_LAST_DATA_ACK:
        printf("I2C_STATUS_SLAVE_SEND_LAST_DATA_ACK\n");
        I2C_SET_CONTROL_REG(port, I2C_I2CON_SI_AA);
        I2C_Flush_Send_Data(&I2C_Send_Control);
        break;
                
        case I2C_STATUS_SLAVE_SEND_ADDR_ACK:
        case I2C_STATUS_SLAVE_SEND_DATA_ACK:
        // if (status == I2C_STATUS_SLAVE_SEND_ADDR_ACK) {
        //     printf("I2C_STATUS_SLAVE_SEND_ADDR_ACK\n");
        // }
        if (status == I2C_STATUS_SLAVE_SEND_DATA_ACK) {
            printf("I2C_STATUS_SLAVE_SEND_DATA_ACK\n");
        }
        //printf("I2C status 0x%X\n", status);
        if(I2C_Send_Byte(&I2C_Send_Control, port, NULL) == I2C_NOTICE_LAST_DATA_SENT) {
            I2C_SET_CONTROL_REG(port, I2C_I2CON_SI);
        } else {
            I2C_SET_CONTROL_REG(port, I2C_I2CON_SI_AA);
        }
        break;
        
        case I2C_STATUS_SLAVE_RECV_ADDR_ACK:
        I2C_SET_CONTROL_REG(port, I2C_I2CON_SI_AA);
        break;
        
        case I2C_STATUS_SLAVE_RECV_DATA_ACK:
        I2C_Recv_Byte(&I2C_Recv_Control, port, NULL);
        I2C_SET_CONTROL_REG(port, I2C_I2CON_SI_AA);
        break;
        
        case I2C_STATUS_SLAVE_RECV_ARBI_LOST:
        case I2C_STATUS_SLAVE_SEND_ARBI_LOST:
        
        case I2C_STATUS_GC_ADDR_ACK:
        case I2C_STATUS_GC_ARBI_LOST:
        case I2C_STATUS_GC_DATA_ACK:
        case I2C_STATUS_GC_DATA_NACK:
        
        case I2C_STATUS_BUS_ERROR:
        case I2C_STATUS_BUS_FREE:
        
        case I2C_STATUS_MASTER_START:
        case I2C_STATUS_MASTER_RESTART:
        case I2C_STATUS_MASTER_SEND_ADDR_ACK:
        case I2C_STATUS_MASTER_SEND_ADDR_NACK:
        case I2C_STATUS_MASTER_SEND_DATA_ACK:
        case I2C_STATUS_MASTER_SEND_DATA_NACK:
        case I2C_STATUS_MASTER_ARBI_LOST:
        case I2C_STATUS_MASTER_RECV_ADDR_ACK:
        case I2C_STATUS_MASTER_RECV_ADDR_NACK:
        case I2C_STATUS_MASTER_RECV_DATA_ACK:
        case I2C_STATUS_MASTER_RECV_DATA_NACK:
        
        default:
        printf("I2C status 0x%X\n", status);
        I2C_RESET();
        break;
    }
}

int32_t main(void)
{    
    /* Unlock protected registers */
    SYS_UnlockReg();

    /* Init System, IP clock and multi-function I/O */
    SYS_Init();

    /* Lock protected registers */
    SYS_LockReg();
    PWM_INIT();
    I2C_INIT();
    #if defined(DEBUG)
    printf("main: 0x%X started.\n", &main);
    
    //Disable_PWM0_INT();
    //Disable_PWM1_INT();
    
    //BPWM_SET_CNR(BPWM0, 0, PWM_Cycle_Per_Period);
    //BPWM_SET_CMR(BPWM0, 0, 2000 * PWM_Cycle_Per_US);
    //BPWM_SET_CMR(BPWM0, 1, 1500 * PWM_Cycle_Per_US);
    //printf("press any key to get status message\n");
    #endif
    
    while (1) {
        if (I2C_TEST_FLAG(&I2C_Recv_Control, I2C_FLAG_FLUSH)) {
            
            I2C_Get_Recv_Data(&I2C_Recv_Control, buf + 7, &buf_len);
            --buf_len;
            memcpy(buf, "echo: [", 7);
            buf_len += 7;
            buf[buf_len] = ']';
            buf[buf_len + 1] = '\0';
            buf_len += 2;
            
            if (buf_len > 12) {
                //printf("%s\n", buf);
                I2C_Set_Send_Data(&I2C_Send_Control, buf, &buf_len);
                I2C_Flush_Send_Data(&I2C_Send_Control);
            }
            buf_len = buf_cap;
        }
    }
    
    /*
    Don't care about close pwm and i2c
    */
}




